import React from "react";

const SandClockSVG = ({ value, ...props }) => {
  // Базовые размеры приняты из макета.
  // уровень песка и пунктирных линий приходят в компонент в диапазоне от 0 до 1,
  // а в svg идет пропорциональное число в виде абсолютных координат в диапазоне от начала до конца песочных часов (1280=0%, 175=100%)
  const getYAbsolute = (value, from = 1157, to = 43) =>
    from - value * (from - to);
  let yAbsolute = getYAbsolute(value);
  return (
    <svg
      height="1200"
      width="671"
      viewBox="0 0 671 1200"
      fill="none"
      xmlns="http://www.w3.org/2000/svg"
      {...props}
    >
      <rect width="671" height="1200" fill="#000" />
      <mask
        id="mask0"
        mask-type="alpha"
        maskUnits="userSpaceOnUse"
        x="35"
        y="0"
        width="599"
        height="1200"
      >
        <path
          d="M35 0H634C634 600 371.777 451.883 371.777 600C371.777 748.117 634 600 634 1200H35C34.9994 600 297.223 748.117 297.223 600C297.223 451.883 34.9968 600 35 0Z"
          fill="#C4C4C4"
        />
      </mask>
      <g mask="url(#mask0)">
        <path d={`M33 1157 h600 V${yAbsolute} h-600`} fill="#00E0FF" />
      </g>
      <path
        d="M632.552 2.5C632.189 300.321 566.867 411.927 502.287 467.562C486.052 481.548 469.799 492.054 454.494 501.118C449.279 504.206 444.145 507.142 439.151 509.999C429.569 515.479 420.504 520.664 412.381 526.055C399.954 534.302 389.383 543.242 381.942 554.963C374.477 566.722 370.283 581.09 370.283 600C370.283 618.91 374.477 633.278 381.942 645.038C389.383 656.758 399.954 665.698 412.381 673.945C420.504 679.336 429.57 684.521 439.151 690.002C444.145 692.858 449.279 695.794 454.494 698.882C469.799 707.946 486.052 718.452 502.287 732.438C566.867 788.073 632.189 899.679 632.552 1197.5H38.4479C38.811 899.679 104.133 788.073 168.713 732.438C184.948 718.452 201.2 707.946 216.506 698.882C221.721 695.794 226.855 692.858 231.849 690.002C241.43 684.521 250.496 679.336 258.619 673.945C271.046 665.698 281.617 656.758 289.058 645.038C296.523 633.278 300.717 618.91 300.717 600C300.717 581.09 296.523 566.722 289.058 554.963C281.617 543.242 271.045 534.302 258.619 526.055C250.495 520.664 241.43 515.479 231.848 509.999C226.854 507.142 221.72 504.206 216.506 501.118C201.2 492.054 184.947 481.548 168.712 467.562C104.132 411.927 38.8098 300.321 38.4479 2.5H632.552Z"
        fill="#00E0FF"
        fillOpacity="0.2"
        stroke="#00E0FF"
        strokeWidth="5"
        strokeLinejoin="round"
      />
      <rect
        x="2.5"
        y="2.53857"
        width="666"
        height="43"
        rx="17.5"
        fill="black"
        stroke="#00E0FF"
        strokeWidth="5"
        strokeLinejoin="round"
      />
      <rect
        x="2.5"
        y="1154.38"
        width="666"
        height="43"
        rx="17.5"
        fill="black"
        stroke="#00E0FF"
        strokeWidth="5"
        strokeLinejoin="round"
      />
    </svg>
  );
};
export default SandClockSVG;
